app/controllers/api/adventures_controller.rb

SELECT  "adventures".* FROM "adventures" WHERE (adventures.lat>37.714717205550286 AND adventures.lat<37.8368323678184 AND adventures.lng>-122.47130638122559 AND adventures.lng<-122.39869361877442) LIMIT 1
---
  def index
    @adventures = Adventure.index_adventures(params[:filters]).includes(:author)