app/controllers/sessions_controller.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "rxVAk2b-UeLvxiTKsIJt9Q"], ["updated_at", "2015-10-13 16:58:25.203017"], ["id", 4]]
---
  def destroy
    current_user.update_session_token!